In [ ]:
import pandas

In [ ]:
df1=pandas.read_csv("data_files\\data.txt", header=None)
df1

In [ ]:
df1.columns = ["ID", "Adress", "City", "ZIP", "Country", "Name", "Employees"]
df1

In [ ]:
df1.set_index("ID", inplace=True, drop=False)
df1

In [ ]:
df1.loc["2":"5","City":"Name"]

In [ ]:
df1.loc[:,"Name"]

In [ ]:
df1.loc[5,"ZIP"]

In [ ]:
list(df1.loc[:,"Name"])

In [ ]:
df1

In [ ]:
df1.iloc[1:4, 1:4]

In [ ]:
df2=pandas.read_csv("data_files\\data.txt", header=None)
df2.columns = ["ID", "Adress", "City", "ZIP", "Country", "Name", "Employees"]
df2.set_index("Name", inplace=True, drop=False)
df2

In [ ]:
df2=df2.drop("Country", 1)
df2.drop("Sanchez", 0, inplace=True)
df2

In [ ]:
df1.shape

In [ ]:
df2["Continent"]=df2.shape[0] * ["North America"]
df2

In [ ]:
df2["Continent"]="America"
df2["Employees"]=df2["Employees"] + 2
df2

In [ ]:
df2

In [146]:
df2_t=df2.T
df2_t["Wojtek"]=[7, "my address", "Pulawy", "1345", "Wojtek", 15, "Europe"]
df2_t["Ben's Shop"]=[4, "my address", "Pulawy", "1345", "Wojtek", 15, "Europe"]

,ID,Adress,City,ZIP,Name,Employees,Continent
Name,,,,,,,
Madeira,1,3666 21st St,San Francisco,CA 94114,Madeira,10,America
Bready Shop,2,735 Dolores St,San Francisco,CA 94119,Bready Shop,17,America
Super River,3,332 Hill St,San Francisco,California 94114,Super River,27,America
Ben's Shop,4,my address,Pulawy,1345,Wojtek,15,Europe
Richvalley,6,551 Alvarado St,San Francisco,CA 94114,Richvalley,22,America
Wojtek,7,my address,Pulawy,1345,Wojtek,15,Europe